{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Aggregated feature-evidence report linking feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files describing layout, pages, components, and styling.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions implementing the black/gold theme with light and dark modes.",
  "frontend/index.html": "HTML entry file setting metadata, SEO tags, fonts, and mounting the web app root.",
  "frontend/public/robots.txt": "Allows all crawlers and points to the public sitemap URL.",
  "frontend/public/sitemap.xml": "XML sitemap listing main site routes with change frequency and priority info.",
  "frontend/src/App.tsx": "Sets up the TanStack Router and wraps the app in a dark-theme provider.",
  "frontend/src/components/contact/ContactForm.tsx": "Client-side validated contact form that opens WhatsApp with a prefilled message and resets after submission.",
  "frontend/src/components/contact/RequestAChange.tsx": "Form for submitting change requests that sends the details via WhatsApp based on selected site area.",
  "frontend/src/components/gallery/Lightbox.tsx": "Modal lightbox component that shows images with captions and supports keyboard and button navigation.",
  "frontend/src/components/layout/FloatingActions.tsx": "Floating WhatsApp and call action buttons with tooltips fixed to the bottom-right of the screen.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying brand info, contact details, proprietor info, and copyright notice.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo and navigation links, including a mobile menu using a sheet drawer.",
  "frontend/src/components/layout/Layout.tsx": "App layout wrapper combining header, footer, floating actions, and routed page content.",
  "frontend/src/components/Section.tsx": "Reusable section wrapper component with optional background pattern support.",
  "frontend/src/components/seo/Seo.tsx": "SEO helper that updates document title and meta tags including Open Graph fields.",
  "frontend/src/content/galleryItems.ts": "Static list of gallery image items containing image paths and captions.",
  "frontend/src/content/siteContent.ts": "Structured site content including hero text, highlights, testimonials, and about information.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refetching queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, CSS variables, typography, dark mode settings, and utility classes for gold-themed UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, company story, values, and services using styled sections and content arrays.",
  "frontend/src/pages/ContactPage.tsx": "Implements the Contact page with SEO, a contact form, contact details, and scroll-to-anchor behavior.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery grid from galleryItems and shows a lightbox when an image is selected.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, service highlights, calls to action, and content sourced from siteContent and galleryItems.",
  "frontend/src/pages/ServicesPage.tsx": "React page that renders the Services screen with SEO tags, a hero section, mapped service cards with benefits, and a WhatsApp CTA.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and theme settings, with plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing the project's state, design requirements, features, branding notes, and architectural guidance for the website."
}