{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Branding + services expansion + WhatsApp contact form for Nihal Plasters & Interior Contractors",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Rename all user-facing branding text and SEO metadata to “Nihal Plasters & Interior Contractors” while preserving the luxury black/gold theme and existing structure.",
      "acceptanceCriteria": [
        "Home/About/Services/Gallery/Contact page SEO titles/descriptions no longer contain “Interior Works”.",
        "Header and Footer brand text/copyright use “Nihal Plasters & Interior Contractors”.",
        "No broken routes or navigation labels after the rename."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/siteContent.ts",
          "operation": "modify",
          "description": "Update brand strings in shared content (hero title and any “Interior Works” mentions within About story/commitment) to “Nihal Plasters & Interior Contractors”, keeping existing tone and theme copy structure."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Update header logo alt text and brand label text to “Nihal Plasters & Interior Contractors” (replace “Interior Works”) without changing navigation structure or routes."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Update footer brand label/copyright to “Nihal Plasters & Interior Contractors” and ensure no remaining “Interior Works” text is user-visible."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update initial document title, meta description, and Open Graph site_name/title/description to use “Nihal Plasters & Interior Contractors” (remove “Interior Works”)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update Home page Seo title/description to use “Nihal Plasters & Interior Contractors” and remove “Interior Works” phrasing while preserving existing layout and luxury theme."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Update About page Seo title/description to use “Nihal Plasters & Interior Contractors” and remove “Interior Works” mentions."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Update Services page Seo title/description to use the updated company name and remove “Interior Works”."
        },
        {
          "path": "frontend/src/pages/GalleryPage.tsx",
          "operation": "modify",
          "description": "Update Gallery page Seo title/description to ensure no “Interior Works” remains and branding aligns with “Nihal Plasters & Interior Contractors”."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update Contact page Seo title/description to use “Nihal Plasters & Interior Contractors” and remove “Interior Works”."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Update address/service-area copy and Google Maps embed on Contact + Footer; ensure About + Contact communicate service coverage all over India.",
      "acceptanceCriteria": [
        "Contact page location text shows the new Amaravati address.",
        "Footer location text shows the new Amaravati address.",
        "The embedded Google Maps iframe points to the updated address (or a map view that clearly corresponds to Amaravati / the provided address).",
        "Service area copy on Contact page and About page communicates “all over India” (not limited to specific cities)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Replace footer location text with: “Sattenapalli Road, Dharani Kota, Indian Gas Front, Amaravati, Andhra Pradesh, India”."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update Contact page location display to the provided Amaravati address; update the Google Maps iframe src to a map view corresponding to “Sattenapalli Road, Dharani Kota, Indian Gas Front, Amaravati, Andhra Pradesh, India”; and update Service Areas copy to clearly state the business serves customers all over India."
        },
        {
          "path": "frontend/src/content/siteContent.ts",
          "operation": "modify",
          "description": "Update About page serviceArea text to clearly state the business serves customers all over India (remove city-limited messaging) while keeping the existing About section structure."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Expand services content and navigation to include PVC Ceiling, Gypsum Ceiling, POP Work, Wall Panels, False Ceiling, Interior Decoration, and Material Supply & Contract Work, and reflect updates in SEO and Home quick-links.",
      "acceptanceCriteria": [
        "Services page displays all requested services as individual entries with descriptions and benefit bullets in the same premium style as existing services.",
        "Home page “Our Services” grid links correctly to the corresponding anchors for all services (including newly added ones).",
        "Services page SEO title/description mention the updated/expanded services set (no missing major items like False Ceiling or Material Supply & Contract Work)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/siteContent.ts",
          "operation": "modify",
          "description": "Update the services array to include all requested offerings as separate entries (with ids/anchors, premium descriptions, and benefit bullets): PVC Ceiling, Gypsum Ceiling, POP Work, Wall Panels, False Ceiling, Interior Decoration, Material Supply & Contract Work. Ensure ids align with intended /services#anchor links."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the Home “Our Services” grid/quick-links to include all requested services and ensure each link targets the correct /services#<id> anchor (including the newly added ones)."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Update Services page Seo title/description to mention the expanded services list (including False Ceiling and Material Supply & Contract Work) and ensure the rendered list reflects the updated siteContent.services ordering and anchors."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Add a luxury-styled Contact Form on Contact page that validates required fields and opens WhatsApp (+91 7523029086) with a URL-encoded prefilled message; align CTA labels to “Get Free Quote”, “Call Contractor”, and “WhatsApp Now”.",
      "acceptanceCriteria": [
        "A visible Contact Form appears on the Contact page with luxury styling consistent with the site theme.",
        "Submitting the form opens a WhatsApp chat to https://wa.me/917523029086 with a prefilled message that includes the entered fields.",
        "Required fields are validated before opening WhatsApp (clear inline errors, no submission when invalid).",
        "At least one prominent CTA uses the exact label “Call Contractor”, and WhatsApp CTAs use “WhatsApp Now” where they are primary actions (without removing existing phone/WhatsApp functionality)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/contact/ContactForm.tsx",
          "operation": "create",
          "description": "Create a luxury-styled Contact Form component that collects name, phone, city, and message/requirements; performs client-side required-field validation with clear inline error states; and on successful submit opens https://wa.me/917523029086 with a URL-encoded prefilled message containing the entered details. Use shadcn-ui form building blocks (e.g., Button, Card, Input, Label, Textarea) to match the existing design system. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Add the new Contact Form section to the Contact page (prominent placement, luxury styling consistent with the theme) and ensure it does not require backend submission; keep existing Contact cards/map content intact."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Align primary CTA labels: change prominent WhatsApp CTA label(s) to “WhatsApp Now” where WhatsApp is the primary action, and ensure at least one prominent phone CTA label uses exact text “Call Contractor” while preserving tel: behavior."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Update service-card CTA label(s) to align with sitewide CTA wording (use “WhatsApp Now” where WhatsApp is the primary action and/or “Get Free Quote” where appropriate) while preserving existing wa.me behavior."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update Contact page action button labels to match required CTAs: use “WhatsApp Now” where WhatsApp is the primary action and include “Call Contractor” on a prominent tel: CTA (without removing existing functionality)."
        },
        {
          "path": "frontend/src/components/layout/FloatingActions.tsx",
          "operation": "modify",
          "description": "Update floating action tooltip/aria-label copy so the WhatsApp primary action reads “WhatsApp Now” (or equivalent visible tooltip) and ensure phone action supports the “Call Contractor” wording where it is user-visible, without changing existing tel:/wa.me links."
        }
      ]
    }
  ]
}